Revit 2024 API
Alignment.GetDisplayedHorizontalCurveEndpoints Method
 Returns the endpoints of the alignment's horizontal curves. Only the points between DisplayedStartStation and DisplayedEndStation are returned.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public IList<HorizontalCurveEndpoint> GetDisplayedHorizontalCurveEndpoints()
Visual Basic
Public Function GetDisplayedHorizontalCurveEndpoints As IList(Of HorizontalCurveEndpoint)
Visual C++
public:
IList<HorizontalCurveEndpoint^>^ GetDisplayedHorizontalCurveEndpoints()
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace